spec_to_spec = {'FrontEnd': 'Фронтенд разработчик', 'Node.js': 'Бэкенд разработчик node.js', 'GameDev': 'Разработчик игр',
     'Embedded': 'Инженер встраиваемых систем', '1C': 'Программист 1С', 'DB': 'Разработчик баз данных',
     'Fullstack': 'Фулстек разработчик', 'C#': 'Бэкенд разработчик c#', 'C++': 'Бэкенд разработчик c++',
     'Golang': 'Бэкенд разработчик golang',
     'Desktop': 'Десктоп разработчик',
     'Mobile': 'Разработчик мобильных приложений', 'Java': 'Бэкенд разработчик java', 'PHP': 'Бэкенд разработчик php',
     'Python': 'Бэкенд разработчик python', 'Ruby': 'Бэкенд разработчик ruby', 'Scala': 'Бэкенд разработчик scala',
     'Devops': 'Девопс инженер', 'QA': 'QA тестировщик', 'CTO': 'Технический директор', 'DA/DBA': 'DA/DBA',
     'Architect': 'Архитектор программного обеспечения', 'Data engineer': 'Инженер по данным',
     'Data science': 'Учёный по данным',
     'Data Analyst': 'Аналитик по данным', 'Техподдержка': 'Специалист по технической поддержке',
     'Технический писатель': 'Технический писатель',
     'Cистемный администратор': 'Системный администратор', 'Информационная безопасность': 'Специалист по ИБ',
     'Cистемная аналитика': 'Системный аналитик', 'Бизнес аналитика': 'Бизнес-аналитик',
     'Продуктовая аналитика': 'Продуктовый аналитик'}

spec_to_spec = {value: key for key, value in spec_to_spec.items()}
